#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <locale>
#define M 3 // Задайте розмір квадратної матриці
int main() {
	setlocale(LC_ALL, "Ukr");
	// Двовимірний масив (квадратна матриця)
	int a[M][M];
	// Ініціалізація генератора випадкових чисел
	srand(time(NULL));
	// Заповнення матриці рандомними значеннями
	for (int i = 0; i < M; i++) {
		for (int j = 0; j < M; j++) {
			a[i][j] = rand() % 101; // Випадкове ціле число в межах від 0 до 100
		}
	}
	// Вивід початкової матриці
	printf("Початкова матриця:\n");
	for (int i = 0; i < M; i++) {
		for (int j = 0; j < M; j++) {
			printf("[%0.2d] ", a[i][j]);
		}
		printf("\n");
	}
	// Знаходження суми елементів головної діагоналі
	int b = 0;
	for (int i = 0; i < M; i++) {
		b += a[i][i];
	}
	// Знаходження суми елементів побічної діагоналі
	int c = 0;
	for (int i = 0; i < M; i++) {
		c += a[i][M - 1 - i];
	}
	// Вивід сум елементів діагоналей
	printf("\nСума головної дiагоналi: %d\n", b);
	printf("Сума побiчної дiагоналi: %d\n", c);
	return 0;
}
